using System;

namespace GB_6._4
{
 /*   4. ** Считайте файл различными способами.Смотрите “Пример записи файла различными способами”.
        Создайте методы, которые возвращают массив byte (FileStream, BufferedStream), строку для StreamReader и массив int для BinaryReader.*/
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
